{
  "navBar": {
    "downloadButton": "Download resume"
  },
  "Resume": {
    "title": "Front-end & Mobile Engineer",
    "aboutSection": {
      "sectionTitle": "About me",
      "summary": {
        "0": "I am a Senior Front-End Developer with solid experience in building and maintaining mobile applications using React Native, as well as web applications using Next.js, React, Angular, and the entire JavaScript/TypeScript ecosystem — always with a strong focus on user experience and performance.",
        "1": "I have been working in agile environments for over 5 years, collaborating in cross-functional teams that follow Scrum and/or Kanban methodologies. I’ve developed applications in the banking, government services, and enterprise solutions sectors.",
        "2": "With a background in product-driven companies, I bring strong problem-solving skills, teamwork, and a mindset for innovation. I'm also experienced in publishing mobile apps to both the Apple App Store and Google Play Store, integrating with APIs, and implementing modern state management solutions such as Redux, Zustand, Context API, and React Query.",
        "3": "I have advanced English skills, which allows me to collaborate effectively in international and multicultural teams."
      }
    },
    "skillsSection": {
      "sectionTitle": "Skills"
    },
    "experienceSection": {
      "sectionTitle": "Experience",
      "experiences": {
        "rolesLabel": "Roles",
        "functionsLabel": "Responsibilities and Achievements",
        "0": {
          "title": "Senior Frontend Engineer",
          "initialDate": "Feb de 2025",
          "finalDate": "Present",
          "roles": {
            "0": {
              "title": "Senior Frontend Engineer",
              "initialDate": "Feb de 2025",
              "finalDate": "Present"
            },
            "1": {
              "title": "Mid Frontend Engineer",
              "initialDate": "May 2024",
              "finalDate": "Feb 2025"
            },
            "2": {
              "title": "Junior Mobile Engineer",
              "initialDate": "Nov 2021",
              "finalDate": "May 2024"
            }
          },
          "company": {
            "name": "JazzTech",
            "location": "São Paulo, SP",
            "linkedin": "https://www.linkedin.com/company/jazztech/"
          },
          "functions": [
            "Developed and enhanced a digital banking app using React Native with Context API, Redux Toolkit, React Navigation, Formik, and Yup.",
            "Implemented and maintained a payroll loan app with React Native, Redux Toolkit, React Navigation, React Hook Form, and Zod.",
            "Built a web application for FGTS-backed loans using Next.js, Redux Toolkit, React Hook Form, Zod, and Material UI.",
            "Developed and maintained a web system for health plan management using Angular.",
            "Managed the publishing and updating of apps on Play Store and App Store, including OTA updates with CodePush (App Center) and Expo Updates (EAS).",
            "Actively participated in meetings with product, design, and back-end teams, contributing to technical and architectural decisions.",
            "Integrated native SDKs (Android and iOS) for facial recognition and liveness detection."
          ]
        },
        "1": {
          "title": " Junior Full Stack Engineer",
          "company": {
            "name": "RW3 Tecnologia",
            "location": "Barueri, SP",
            "linkedin": "https://www.linkedin.com/company/rw3tecnologia/"
          },
          "initialDate": "Apr 2021",
          "finalDate": "Nov 2021",
          "functions": [
            "Developed and maintained government applications using React Native with TypeScript, adopting MobX for state management.",
            "Implemented the back-end using Ts.ED framework and integrated APIs from public institutions such as DETRAN, PGE, and SEDUC.",
            "Led the development of the active debt negotiation module in the mobile app and handled full integration with the PGE API on the back-end.",
            "Participated in meetings with product and design teams, providing input on technical and architectural decisions."
          ]
        },
        "2": {
          "title": "Software Engineer intern",
          "company": {
            "name": "Baymetrics Tecnologia",
            "location": "Barueri, SP",
            "linkedin": "https://www.linkedin.com/company/baymetrics/"
          },
          "initialDate": "Dec 2019",
          "finalDate": "Dec 2020",
          "functions": [
            "Developed business applications using Microsoft Power Platform (Power Apps and Power Automate) for clients such as TV Globo, Natura, and C&A."
          ]
        }
      }
    },
    "educationSection": {
      "sectionTitle": "Education",
      "degrees": {
        "0": {
          "title": "Associate&apos;s Degree in Systems Analysis and Development",
          "initialDate": "Aug 2019",
          "finalDate": "Jul 2022",
          "institution": {
            "name": "Centro Paula Souza - Fatec",
            "linkedin": "https://www.linkedin.com/school/fatec-santana-de-parna%C3%ADba/",
            "location": "Satana de Parnaíba, Brazil"
          }
        }
      }
    }
  }
}
