{
  "navBar": {
    "downloadButton": "Download resume"
  },
  "Resume": {
    "title": "Front-end & Mobile Engineer",
    "aboutSection": {
      "sectionTitle": "About me",
      "summary": {
        "0": "I am a Senior Front-End Developer with solid experience in building and maintaining mobile applications using React Native, as well as web applications using Next.js, React, Angular, and the entire JavaScript/TypeScript ecosystem — always with a strong focus on user experience and performance.",
        "1": "I have been working in agile environments for over 5 years, collaborating in cross-functional teams that follow Scrum and/or Kanban methodologies. I’ve developed applications in the banking, government services, and enterprise solutions sectors.",
        "2": "With a background in product-driven companies, I bring strong problem-solving skills, teamwork, and a mindset for innovation. I'm also experienced in publishing mobile apps to both the Apple App Store and Google Play Store, integrating with APIs, and implementing modern state management solutions such as Redux, Zustand, Context API, and React Query.",
        "3": "I have advanced English skills, which allows me to collaborate effectively in international and multicultural teams."
      }
    },
    "skillsSection": {
      "sectionTitle": "Skills"
    },
    "experienceSection": {
      "sectionTitle": "Experience",
      "experiences": {
        "0": {
          "title": "Senior Frontend Engineer",
          "company": {
            "name": "JazzzTech",
            "location": "São Paulo, SP",
            "linkedin": "https://www.linkedin.com/company/jazzztech/"
          },
          "initialDate": "Feb de 2022",
          "finalDate": "Present",
          "functions": [
            "Lead development and maintenance of core React Native mobile apps (iOS & Android) and web platforms using Angular (13+) and Next.js",
            "Support the tech lead in app store deployments (Apple App Store and Google Play) and feature delivery via CodePush (App Center) and Expo Updates (EAS)",
            "Actively participate in product meetings, offering technical insights and feasibility analysis"
          ]
        },
        "1": {
          "title": "Mid Level Frontend Enginerr",
          "company": {
            "name": "JazzzTech",
            "location": "São Paulo, SP",
            "linkedin": "https://www.linkedin.com/company/jazzztech/"
          },
          "initialDate": "May 2024",
          "finalDate": "Feb 2025",
          "functions": [
            "Maintained and developed mobile/web applications with increasing ownership",
            "Built major features for the new credit card and investments modules",
            "Designed and developed key parts of a consignment loan app (React Native)",
            "Collaborated on a white-label web solution for FGTS anticipation (Next.js)",
            "Contributed to maintaining a health insurance web platform (Angular)"
          ]
        },
        "2": {
          "title": "Junior Mobile Engineer",
          "company": {
            "name": "JazzzTech",
            "location": "São Paulo, SP",
            "linkedin": "https://www.linkedin.com/company/jazzztech/"
          },
          "initialDate": "Nov 2021",
          "finalDate": "May 2024",
          "functions": [
            "Maintained the company's flagship React Native application",
            "Delivered pixel-perfect features based on Figma prototypes",
            "Integrated facial recognition and liveness detection SDK to prevent fraud",
            "Contributed to a complete visual rebranding of the mobile app",
            "Built a limit management module (daily, monthly, daytime, and nighttime limits)"
          ]
        },
        "3": {
          "title": " Junior Full Stack Engineer",
          "company": {
            "name": "RW3 Tecnologia",
            "location": "Barueri, SP",
            "linkedin": "https://www.linkedin.com/company/rw3tecnologia/"
          },
          "initialDate": "Apr 2021",
          "finalDate": "Nov 2021",
          "functions": [
            "Developed and maintained mobile apps (React Native) and backend services (Node.js)",
            "Built the active debt negotiation module and integrated with state APIs",
            "Participated in developing services for traffic, vehicle, document, fine, and debt consultations"
          ]
        },
        "4": {
          "title": "Software Engineer intern",
          "company": {
            "name": "Baymetrics Tecnologia",
            "location": "Barueri, SP",
            "linkedin": "https://www.linkedin.com/company/baymetrics/"
          },
          "initialDate": "Dec 2019",
          "finalDate": "Dec 2020",
          "functions": [
            "Built business apps using the Microsoft Power Platform",
            "Developed solutions with Power Apps and Power Automate"
          ]
        }
      }
    },
    "educationSection": {
      "sectionTitle": "Education",
      "degrees": {
        "0": {
          "title": "Associate&apos;s Degree in Systems Analysis and Development",
          "initialDate": "Aug 2019",
          "finalDate": "Jul 2022",
          "institution": {
            "name": "Centro Paula Souza - Fatec",
            "linkedin": "https://www.linkedin.com/school/fatec-santana-de-parna%C3%ADba/",
            "location": "Satana de Parnaíba, Brazil"
          }
        }
      }
    }
  }
}
