{
  "navBar": {
    "downloadButton": "Baixar CV"
  },
  "Resume": {
    "title": "Desenvolvedor FrontEnd e Mobile",
    "aboutSection": {
      "sectionTitle": "Sobre mim",
      "summary": {
        "0": "Sou desenvolvedor front-end sênior com mais de 5 anos de experiência na criação e manutenção de aplicações mobile com React Native e web com Next.js, React e Angular, atuando em todo o ecossistema JavaScript/TypeScript — sempre com foco em performance e experiência do usuário.",
        "1": "Tenho atuado em ambientes ágeis (Scrum e Kanban) como parte de times multidisciplinares, desenvolvendo soluções para os setores bancário, governamental e corporativo.",
        "2": "Possuo sólida experiência em publicação de apps nas lojas (Google Play e App Store), integração com APIs REST/GraphQL e gerenciamento de estado (Redux, Zustand, React Context). Tenho inglês avançado e facilidade para colaborar com equipes internacionais.",
        "3": "Com vivência em empresas de produto, desenvolvi fortes habilidades em resolução de problemas, trabalho em equipe e inovação, adquiridas pela atuação em diferentes indústrias e contextos de negócio."
      }
    },
    "skillsSection": {
      "sectionTitle": "Tecnologias"
    },
    "experienceSection": {
      "sectionTitle": "Experiência Profissional",
      "experiences": {
        "rolesLabel": "Cargos exercidos",
        "functionsLabel": "Responsabilidades e Conquistas",
        "0": {
          "title": "Desenvolvedor Front-end Senior",
          "initialDate": "Novembro de 2021",
          "finalDate": "o momento",
          "roles": {
            "0": {
              "title": "Desenvolvedor Front-end Senior",
              "initialDate": "Fevereiro de 2025",
              "finalDate": "o momento"
            },
            "1": {
              "title": "Desenvolvedor Front-end Pleno",
              "initialDate": "Maio de 2024",
              "finalDate": "Fevereiro 2025"
            },
            "2": {
              "title": "Desenvolvedor Mobile Junior",
              "initialDate": "Novembro de 2021",
              "finalDate": "Maio de 2024"
            }
          },
          "company": {
            "name": "JazzTech",
            "location": "São Paulo, SP",
            "linkedin": "https://www.linkedin.com/company/jazztech/"
          },
          "functions": [
            "Desenvolvi e evoluí um aplicativo de banco digital com React Native, utilizando Context API, Redux Toolkit, React Navigation, Formik e Yup.",
            "Implementei e mantive um app de Empréstimos Consignados com React Native, Redux Toolkit, React Navigation, React Hook Form e Zod.",
            "Desenvolvi uma aplicação web para empréstimos com garantia de FGTS, usando Next.js, Redux Toolkit, React Hook Form, Zod e Material UI.",
            "Implementei e mantive um sistema web para gerenciamento de planos de saúde utilizando Angular.",
            "Gerenciei a publicação e atualização de apps nas lojas (Play Store e App Store), incluindo atualizações OTA com CodePush (App Center) e Expo Updates (EAS).",
            "Colaborei ativamente em reuniões com os times de produto, design e back-end, contribuindo com decisões técnicas e de arquitetura.",
            "Realizei integração de SDKs nativas (Android e iOS) para reconhecimento facial e verificação de vida (liveness detection)."
          ]
        },
        "1": {
          "title": "Desenvolvedor Full Stack Junior",
          "company": {
            "name": "RW3 Tecnologia",
            "location": "Barueri, SP",
            "linkedin": "https://www.linkedin.com/company/rw3tecnologia/"
          },
          "initialDate": "Abril de 2021",
          "finalDate": "Novembro de 2021",
          "functions": [
            "Desenvolvi e mantive aplicações governamentais com React Native e TypeScript, utilizando MobX para gerenciamento de estado.",
            "Implementei o back-end com o framework Ts.ED, realizando integrações com APIs de órgãos públicos como DETRAN, PGE e SEDUC.",
            "Fui responsável pelo módulo de negociação de dívidas ativas no app mobile, incluindo toda a integração com a API da PGE no back-end.",
            "Participei de reuniões com times de produto e design, contribuindo com decisões técnicas e sugestões de arquitetura."
          ]
        },
        "2": {
          "title": "Estagiário em Engenharia de Software",
          "company": {
            "name": "Baymetrics Tecnologia",
            "location": "Barueri, SP",
            "linkedin": "https://www.linkedin.com/company/baymetrics/"
          },
          "initialDate": "Dezembro de 2019",
          "finalDate": "Dezembro de 2020",
          "functions": [
            "Desenvolvi aplicações empresáriais usando Microsoft PowerPlatform (PowerApps e PowerAutomate) para clientes como TB Globo, Natura e C&A"
          ]
        }
      }
    },
    "educationSection": {
      "sectionTitle": "Formação Acadêmica",
      "degrees": {
        "0": {
          "title": "Tecnólogo em Análise e Desenvolvimento de Sistemas",
          "initialDate": "Agosto de 2019",
          "finalDate": "Julho de 2022",
          "institution": {
            "name": "Centro Paula Souza - Fatec",
            "linkedin": "https://www.linkedin.com/school/fatec-santana-de-parna%C3%ADba/",
            "location": "Satana de Parnaíba, Brazil"
          }
        }
      }
    }
  }
}
